use desserts;

-- 甜品种类
insert into category(name, descp)
values ('传统甜品','精致到不忍下嘴的中国传统甜品,个个都经典'),
       ('凉粉系列','创意凉粉系列,将凉粉这一种民间小吃融入菜肴'),
       ('雪山系列','造型高颜值,口感绵软,越嚼越有嚼劲');

-- 甜品
insert into dessert (name, photoUrl, price, descp, release_date, cat_id)
values ('生磨芝麻糊加黑糯米', '/photo/001.jpg', 15, '满满一碗芝麻糊中央放了一个圆圆的黑
糯米球，入口醇香柔滑，满满一口，让人齿颊留香', '2024-02-01', 1),
       ('鲜杂果凉粉(椰汁芒汁)', '/photo/002.jpg', 20, '新鲜水果料足量多，吸引人眼球。如艺
术品般令人赞叹的造型，味道也很赞。', '2024-02-03', 2),
       ('生磨芝麻糊加黑糯米', '/photo/003.jpg', 25, '满满一碗芝麻糊中央放了一个圆圆的黑糯
米球，入口醇香柔滑，满满一口，让人齿颊留香', '2024-02-05', 1);

insert into dessert (name, photoUrl, price, descp, release_date, cat_id)
values ('生磨芝麻糊加黑糯米Ⅱ', '/photo/001.jpg', 15, '满满一碗芝麻糊中央放了一个圆圆的
黑糯米球，入口醇香柔滑，满满一口，让人齿颊留香', '2024-02-01', 1),
       ('鲜杂果凉粉(椰汁芒汁)Ⅱ', '/photo/002.jpg', 20, '新鲜水果料足量多，吸引人眼球。如
艺术品般令人赞叹的造型，味道也很赞。', '2024-02-03', 2),
       ('生磨芝麻糊加黑糯米Ⅱ', '/photo/003.jpg', 25, '满满一碗芝麻糊中央放了一个圆圆的黑
糯米球，入口醇香柔滑，满满一口，让人齿颊留香', '2024-02-05', 1);

insert into dessert (name, photoUrl, price, descp, release_date, cat_id)
values ('生磨芝麻糊加黑糯米Ⅲ', '/photo/001.jpg', 15, '满满一碗芝麻糊中央放了一个圆圆的
黑糯米球，入口醇香柔滑，满满一口，让人齿颊留香', '2024-02-01', 1),
       ('鲜杂果凉粉(椰汁芒汁)Ⅲ', '/photo/002.jpg', 20, '新鲜水果料足量多，吸引人眼球。如
艺术品般令人赞叹的造型，味道也很赞。', '2024-02-03', 2),
       ('生磨芝麻糊加黑糯米Ⅲ', '/photo/003.jpg', 25, '满满一碗芝麻糊中央放了一个圆圆的黑
糯米球，入口醇香柔滑，满满一口，让人齿颊留香', '2024-02-05', 1);

-- 用户
insert into t_user(username,password)
values
    ('admin','12345'),
    ('bob','123');

-- 职称
insert into t_role(role)
values
    ('老板'),
    ('店长'),
    ('收银员'),
    ('甜品师'),
    ('后厨'),
    ('服务员'),
    ('保洁');


insert into t_user_role(user_id, role_id)
VALUES
    (1, 1),
    (2,2);